# Question_7_Solution:

**Insights to be drawn -**

- Get all the Earth meteorites that fell before the year 2000
- Get all the earth meteorites co-ordinates who fell before the year 1970
- Assuming that the mass of the earth meteorites was in kg, get all those whose mass was more than 10000kg

**Note -**
1. Draw plots to demonstrate the analysis for the following questions for better visualizations
2. Write code comments wherever required for code understanding

In [1]:
import pandas as pd

In [2]:
# Using the data from Question 4 Solution:
df = pd.read_csv("Question_4_Solution.csv")
df.head()

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,geolocation.type,geolocation.coordinates,:@computed_region_cbhk_fwbd,:@computed_region_nnqa_25f4
0,Aachen,1,Valid,L5,21.0,Fell,1880-01-01T00:00:00.000,50.77500,6.08333,Point,"[6.08333, 50.775]",NaN,NaN
1,Aarhus,2,Valid,H6,720.0,Fell,1951-01-01T00:00:00.000,56.18333,10.23333,Point,"[10.23333, 56.18333]",NaN,NaN
2,Abee,6,Valid,EH4,107000.0,Fell,1952-01-01T00:00:00.000,54.21667,-113.00000,Point,"[-113, 54.21667]",NaN,NaN
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,1976-01-01T00:00:00.000,16.88333,-99.90000,Point,"[-99.9, 16.88333]",NaN,NaN
4,Achiras,370,Valid,L6,780.0,Fell,1902-01-01T00:00:00.000,-33.16667,-64.95000,Point,"[-64.95, -33.16667]",NaN,NaN

In [3]:
df.shape

(1000, 13)

In [4]:
df.columns

Index(['name', 'id', 'nametype', 'recclass', 'mass', 'fall', 'year', 'reclat',
       'reclong', 'geolocation.type', 'geolocation.coordinates',
       ':@computed_region_cbhk_fwbd', ':@computed_region_nnqa_25f4'],
      dtype='object')

In [5]:
df.dtypes

name                            object
id                               int64
nametype                        object
recclass                        object
mass                           float64
fall                            object
year                            object
reclat                         float64
reclong                        float64
geolocation.type                object
geolocation.coordinates         object
:@computed_region_cbhk_fwbd    float64
:@computed_region_nnqa_25f4    float64
dtype: object

# 1. Get all the Earth meteorites that fell before the year 2000

In [6]:
df['year']

0      1880-01-01T00:00:00.000
1      1951-01-01T00:00:00.000
2      1952-01-01T00:00:00.000
3      1976-01-01T00:00:00.000
4      1902-01-01T00:00:00.000
                ...
995    1934-01-01T00:00:00.000
996    2011-01-01T00:00:00.000
997    1869-01-01T00:00:00.000
998    1922-01-01T00:00:00.000
999    1905-01-01T00:00:00.000
Name: year, Length: 1000, dtype: object

In [8]:
# Getting proper year:mm:dd format
df['year'] = pd.to_datetime(df['year'], errors='coerce').dt.strftime("%Y")

In [10]:
df['year'] = pd.to_datetime(df['year'])
df['year']

0     1880-01-01
1     1951-01-01
2     1952-01-01
3     1976-01-01
4     1902-01-01
         ...
995   1934-01-01
996   2011-01-01
997   1869-01-01
998   1922-01-01
999   1905-01-01
Name: year, Length: 1000, dtype: datetime64[ns]

In [25]:
ans_1 = df[df['year'] < '2000-01-01'][['name','year']]
ans_1

          name       year
0       Aachen 1880-01-01
1       Aarhus 1951-01-01
2         Abee 1952-01-01
3     Acapulco 1976-01-01
4      Achiras 1902-01-01
..         ...        ...
994   Timochin 1807-01-01
995   Tirupati 1934-01-01
997      Tjabe 1869-01-01
998   Tjerebon 1922-01-01
999  Tomakovka 1905-01-01

[912 rows x 2 columns]

plt.figure(figsize=(50, 10))
plt.scatter(ans_1['name'], ans_1['year'])
plt.xlabel('Name')
plt.ylabel('Year')
plt.title('Earth meteorites that fell before the year 2000')
plt.xticks(rotation=90)
plt.show()

# 2. Get all the earth meteorites co-ordinates who fell before the year 1970

In [16]:
ans_2 = df[df['year'] < '1970-01-01'][['name','year','geolocation.coordinates']]
ans_2

          name       year geolocation.coordinates
0       Aachen 1880-01-01       [6.08333, 50.775]
1       Aarhus 1951-01-01    [10.23333, 56.18333]
2         Abee 1952-01-01        [-113, 54.21667]
4      Achiras 1902-01-01     [-64.95, -33.16667]
5     Adhi Kot 1919-01-01            [71.8, 32.1]
..         ...        ...                     ...
994   Timochin 1807-01-01            [35.2, 54.5]
995   Tirupati 1934-01-01    [79.41667, 13.63333]
997      Tjabe 1869-01-01   [111.53333, -7.08333]
998   Tjerebon 1922-01-01   [106.58333, -6.66667]
999  Tomakovka 1905-01-01       [34.76667, 47.85]

[763 rows x 3 columns]

# 3. Assuming that the mass of the earth meteorites was in kg, get all those whose mass was more than 10000kg

In [23]:
ans_3 = df[df['mass'] > 10000][['name','mass']]
ans_3

           name      mass
2          Abee  107000.0
7          Agen   30000.0
11          Aïr   24000.0
16      Akyumak   50000.0
27   Alfianello  228000.0
..          ...       ...
991   Tieschitz   28000.0
992      Tilden   74800.0
994    Timochin   65500.0
997       Tjabe   20000.0
998    Tjerebon   16500.0

[243 rows x 2 columns]